nacaAirfoil_fluid_LaunderSharmaKE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (600 148.16 0);

boundaryField
{
    INLE1
    {
        type            supersonicFreestream;
        pInf            100000;
        TInf            300;
        UInf            (600 148.16 0);
        gamma           1.4;
        value           uniform (600 148.16 0);
    }

    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform (600 148.16 0);
    }

    SYMP3
    {
        type            empty;
    }

    WALL10
    {
        type            noSlip;
    }
}

// ************************************************************************* //
