nacaAirfoil_fluid_LaunderSharmaKE/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentEpsilon];

internalField   uniform 25000;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 25000;
    }
    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 25000;
    }
    SYMP3
    {
        type            empty;
    }
    WALL10
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 25000;
    }
}


// ************************************************************************* //
