nacaAirfoil_fluid_LaunderSharmaKE/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 1000;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 1000;
    }
    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 1000;
    }
    SYMP3
    {
        type            empty;
    }
    WALL10
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }
}


// ************************************************************************* //
