nacaAirfoil_fluid_LaunderSharmaKE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 100000;

boundaryField
{
    INLE1
    {
        type            zeroGradient;
    }

    OUTL2
    {
        type            waveTransmissive;
        field           p;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }

    SYMP3
    {
        type            empty;
    }

    WALL10
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
